[
    {
        "title": { "se": "Praktisk Kunskap", "en": "Practical Knowledge"},
        "desc": {
            "se": "Utbildningen ger möjligheten för studenter att utföra yrkesträning (praktik) ute på en arbetsplats. Detta kan göras inom kandidaten, som en del av kandidatexamensarbetet eller ej, men även inom mastern. Detta är ett utmärkt tillfälle för studenter att ge sig ut på arbetsmarknaden tidigt. Är ditt företag intresserade av att husa praktikanter hos er? Besök kursidan nedan:",
            "en": "The program gives students the possibilty to perform practical work at an employer in the field. This can be done during the bachelors, as part of the thesis or not, but also during the master studies. This is an excellent opportunity for students to get out into the field early on. Is your company interested in hosting interns? Visit the course site below:"
        },
        "courses": [
            {
                "title": {
                    "se": "DM1998 Ingenjörsinriktad yrkesträning",
                    "en": "DM1998 Engineering Training Course"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1998"
            }
        ]

    },
    {
        "title": { "se": "Interaktiva Program", "en": "Interactive Programs" },
        "desc": {
            "se": "Ett stort fokus inom vår inriktning är människa-datorinteraktion. En viktig aspekt av detta är hur användare interagerar med våra produkter. Därför lär sig våra studenter att arbeta med ramverk som React och Vue, men även att räkna och programmera grafiska gränssnitt. Vi har erfarenhet med att utveckla webbapplikationer/hemsidor som är både funktionella men även väldesignade.",
            "en": "A big focus within our program is human-computer interaction. An important aspect of this is how users interact with our products. Because of this, our students learn to work with frameworks like Vue and React, but also programming and computing graphical interfaces. We have experience developing web applications that are both functional and well-designed."
        },
        "courses": [
            {
                "title": {
                    "se": "DH2642 Interaktionsprogrammering och dynamiska webben",
                    "en": "DH2642 Interaction Programming and the Dynamic Web"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH2642"
            },
            {
                "title": {
                    "se": "DH2323 Datorgrafik med interaktion",
                    "en": "DH2323 Computer Graphics and Interaction"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH2323"
            },
            {
                "title": {
                    "se": "DH1622 Människa-datorinteraktion, inledande kurs",
                    "en": "DH1622 Human-Computer Interaction, Introductory Course"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH1622"
            }
        ]
    },
    {
        "title": { "se": "Programmering", "en": "Programming" },
        "desc": {
            "se": "I programmeringskurserna programmerar vi i språken Python och Java och får grundläggande kunskaper inom språken för att sedan även övergå till en mer avancerad nivå. \n\nProgrammeringsspråk och verktyg vi lär oss:\n Språk: Python, Java, Javascript, SQL, C#, m.m\n Design: HTML, CSS\n Ramverk: React, Vue, Redux",
            "en": "In the programming courses we program in the languages Python and Java. At first we gain basic knowledge in order to later move on to an advanced level. \n\nProgramming languages and tools that we learn:\n Languages: Python, Java, Javascript, SQL, C#, etc.\n Design: HTML, CSS\n Frameworks: React, Vue, Redux"
        },
        "courses": [
            {
                "title": {
                    "se": "DD1318 Programmeringsteknik och tekniska beräkningar",
                    "en": "DD1318 Programming and Scientific Computing"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DD1318"
            },
            {
                "title": {
                    "se": "DM1595 Programutveckling för interaktiva medier",
                    "en": "DM1595 Program Development for Interactive Media"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1595"
            },
            {
                "title": {
                    "se": "DD1380 Javaprogrammering för Pythonprogrammerare",
                    "en": "DD1380 Java Programming for Python Programmers"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DD1380"
            },
            {
                "title": {
                    "se": "DH2642 Interaktionsprogrammering och dynamiska webben",
                    "en": "DH2642 Interaction Programming and the Dynamic Web"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH2642"
            }
        ]
    },
    {
        "title": { "se": "Datalogi", "en": "Computer Science" },
        "desc": {
            "se": "Kandidaten ger en grundläggande och bred utbildning inom datalogi. Genom dessa kurser lär vi oss om teoretiska och praktiska tillämpningar av algoritmer, datastrukturer och komplexitet. Mycket av det som lärs ut i dessa kurser byggs vidare på i datalogimastern men är även användbar för de som läser andra masters.",
            "en": "The bachelor’s program provides a broad education in computer science. Through these courses we learn about theoretical and practical applications of algorithms, data structures and complexity. A lot of what is learned in these courses is built on in the computer science master but is also useful in other masters."
        },
        "courses": [
            {
                "title": {
                    "se": "DD2532 Algoritmer och Komplexitet",
                    "en": "DD2532 Algorithms and Complexity"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DD2532"
            },
            {
                "title": {
                    "se": "DD1320 Tillämpad datalogi",
                    "en": "DD1320 Applied Computer Science"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DD1320"
            },
            {
                "title": {
                    "se": "DD1354 Modeller och simulering",
                    "en": "DD1354 Models and Simulation"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DD1354"
            }
        ]
    },
    {
        "title": {
            "se": "Entreprenörskap och Ledarskap",
            "en": "Entrepreneurship and Management"
        },
        "desc": {
            "se": "Medieteknikstudenter får en bra grund i entreprenörskap och ledarskap. Detta märks i det faktum att en stor del av våra alumner blir egenföretagare eller tar chefspositioner inom företag. I dessa kurser lär sig våra studenter om hur man driver projekt i team, entreprenörskap och marknadsföring tillsammans med en gedigen grund inom ekonomi.",
            "en": "Media technology students get a good foundation in entrepreneurship and leadership. This is noticeable due to the fact that many of our alumni become self-employed or have managerial positions within companies. In these courses our students learn about how to lead projects in teams, entrepreneurship and marketing. They also achieve a solid foundation in financing."
        },
        "courses": [
            {
                "title": {
                    "se": "ME1003 Industriell ekonomi, grundkurs",
                    "en": "ME1003 Industrial Management, Basic Course"
                },
                "url": "https://www.kth.se/student/kurser/kurs/ME1003"
            },
            {
                "title": {
                    "se": "ME1042 Entreprenörskap inom Media och IKT",
                    "en": "ME1042 Entrepreneurship for Media and ICT"
                },
                "url": "https://www.kth.se/student/kurser/kurs/ME1042"
            },
            {
                "title": {
                    "se": "LS1464 Retorik - konsten att övertyga",
                    "en": "LS1464 Rhetoric - the Art of Persuasion"
                },
                "url": "https://www.kth.se/student/kurser/kurs/LS1464"
            },
            {
                "title": {
                    "se": "ME2016 Projektledning: ledning och styrning av projekt",
                    "en": "ME2016 Project Management: Leadership and Control"
                },
                "url": "https://www.kth.se/student/kurser/kurs/ME2016"
            },
            {
                "title": {
                    "se": "ME2163 Ledarskap och organisering i olika miljöer",
                    "en": "ME2163 Leading People and Organizations in Different Contexts"
                },
                "url": "https://www.kth.se/student/kurser/kurs/ME2163"
            }
        ]
    },
    {
        "title": { "se": "Signalbehandling", "en": "Signal Processing" },
        "desc": {
            "se": "Vi medietekniker har ett brett kunnande när det kommer till signalbehandling. Vi har inte enbart kunskaper om de tekniska bitarna kring signalbehandling, utan även hur man använder digital teknik i form av ljud och bild inom medieproduktion. Vi lär oss grundligt om de fysikaliska egenskaperna hos ljud, ljus och bild och hur dessa fenomen kan skapa begränsningar och villkor för teknik. Hit hör även kunskaper om olika typer av signaler och deras digitala representation och hur de kan modifieras med hjälp av filter. \n\nVi lär oss om akustik och ljudbehandling, tekniska tillämpningar som mikrofoner och högtalare samt hur man gör en digital representation av ljud. Vi är även kompetenta inom fotometri och hur en digitalkamera och dess komponenter fungerar. En stor del av vår kompetens kretsar kring hur videosignaler upptas, lagras och distribueras med hjälp av komprimeringsalgoritmer. \n\nTredje året erbjuds vi kurser inom talteknologi och musikakustik. Talteknologin fokuserar mycket på muntlig interaktion mellan människor och datorer. Musikakustiken handlar om elektroakustiska instrument och interaktionsaspekterna kring dessa.",
            "en": "We media technology students have a broad knowledge when it comes to signal processing. We’re good at not only handling the technical aspects but also how to use digital technology like sound and picture in media production. At first we learn about the physical properties of sound, picture and light and how these phenomena can create limitations and conditions for technology. Later, we learn how to modify signals by utilizing filters. \n\nWe learn about acoustics and sound processing, technical applications such as microphones and speakers and how to make a digital representation of sound. We are also competent in photometry and how a digital camera and its components work. A big part of our expertise revolves around how video signals are recorded, stored and distributed with the help of compression algorithms. \n\nThe third year we are offered courses in speech technology and music acoustics. Speech technology focuses on the oral interaction between humans and computers. Music acoustics is about electroacoustic instruments and the interaction aspects around them."
        },
        "courses": [
            {
                "title": {
                    "se": "DM1579 Medieproduktion",
                    "en": "DM1579 Media Production"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1579"
            },
            {
                "title": {
                    "se": "DM1135 Multimediasystem och signaler",
                    "en": "DM1135 Multimedia Systems and Signals"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1135"
            },
            {
                "title": {
                    "se": "SK1120 Vågrörelselära",
                    "en": "SK1120 Waves"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SK1120"
            },
            {
                "title": {
                    "se": "DM1580 Videoteknik",
                    "en": "DM1580 Video Technology"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1580"
            },
            {
                "title": {
                    "se": "SK1140 Fotografi för medieteknik",
                    "en": "SK1140 Photography for Media"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SK1140"
            },
            {
                "title": { "se": "DT1175 Ljud", "en": "DT1175 Sound" },
                "url": "https://www.kth.se/student/kurser/kurs/DT1175"
            },
            {
                "title": {
                    "se": "DT2112 Talteknologi",
                    "en": "DT2112 Speech Technology "
                },
                "url": "https://www.kth.se/student/kurser/kurs/DT2112"
            },
            {
                "title": {
                    "se": "DT2212 Musikakustik",
                    "en": "DT2212 Music Acoustics"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DT2212"
            }
        ]
    },
    {
        "title": {
            "se": "Människa-datorinteraktion",
            "en": "Human-Computer Interaction"
        },
        "desc": {
            "se": "I MDI- kurserna studerar vi informationsteknologi och gränssnitt för ett bra samspel mellan datorer och människor. För användbara lösningar beroende på mottagare, inkluderar att man tar hänsyn till kulturer, miljö och person. Vi studerar kommunikation genom media samt relationen mellan skapare och mottagare.",
            "en": "In the HCI courses we study information technology and interfaces for creating good interaction between humans and computers. For useful solutions, depending on who the recipient is, we learn how to take in account cultures, environments and personality. We study communication through media as well as the relationship between creator and recipient."
        },
        "courses": [
            {
                "title": {
                    "se": "DH1609 Kommunikation och information",
                    "en": "DH1609 Communication and information"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH1609"
            },
            {
                "title": {
                    "se": "DM2573 Hållbarhet och medieteknik",
                    "en": "DM2573 Sustainability and Media Technology"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM2573"
            },
            {
                "title": {
                    "se": "DM2720 Hållbar informations- och kommunikationsteknik (IKT) i praktiken",
                    "en": "DM2720 Sustainable Information and Communication Technology (ICT) in Practice"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM2720"
            },
            {
                "title": {
                    "se": "DH1622 Människa-datorinteraktion, inledande kurs",
                    "en": "DH1622 Human-Computer Interaction, Introductory Course"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DH1622"
            },
            {
                "title": {
                    "se": "AK2203 Media mellan teknik och kultur",
                    "en": "AK2203 Media, Technology and Culture"
                },
                "url": "https://www.kth.se/student/kurser/kurs/AK2203"
            },
            {
                "title": {
                    "se": "DM2556 Interkulturell kommunikation",
                    "en": "DM2556 Intercultural communication"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM2556"
            },
            {
                "title": {
                    "se": "DM2624 Människoncenterad teknik för funktionshinder",
                    "en": "DM2624 Human Centered Technology for Disabilities"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM2624"
            }
        ]
    },
    {
        "title": {
            "se": "Fysisk Interaktion",
            "en": "Physical Interaction"
        },
        "desc": {
            "se": "Medietekniker har god kunskap inom sensorprogrammering. Vi lär oss om hur sensorer och ställdon kan programmeras i ett kommersiellt system, exempelvis Arduino, och hur konstellationen kan användas i olika syften. Dessutom lär vi oss designa digital elektroteknik och att bygga elektroniska kretsar.",
            "en": "Media technicians have a solid knowledge in sensor programming. We learn how sensors and actuators can be programmed in a commercial system, for example Arduino, and how they can be used for different purposes. In addition, we learn to design electrical engineering and how to build electronic circuits."
        },
        "courses": [
            {
                "title": {
                    "se": "DM1588 Sensorprogrammering för medieteknik",
                    "en": "DM1588 Sensor Programming for Media Technology"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1588"
            }
        ]
    },
    {
        "title": { "se": "Maskininlärning", "en": "Machine Learning" },
        "desc": {
            "se": "Studenter på medieteknik får även i ett tidigt stadium lära sig om maskininlärning och hur det används i olika sammanhang. De får också ta del av hur man arbetar när det kommer till maskininlärning och hur man använder sig av de två stora metoderna inom området, det vill säga väglett och icke-väglett lärande. För dessa metoder lär man sig mer om olika typer av algoritmer.",
            "en": "Media technicians learn at an early stage about machine learning and how it is utilized in different contexts. We also learn how to use the two major methods in the field: guided and non-guided learning. For these methods, you learn more about different types of algorithms."
        },
        "courses": [
            {
                "title": {
                    "se": "DM1590 Maskininlärning för Medieteknik",
                    "en": "DM1590 Machine Learning for Media Technology"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1590"
            },
            {
                "title": {
                    "se": "DM1580 Videoteknik",
                    "en": "DM1580 Video Technology"
                },
                "url": "https://www.kth.se/student/kurser/kurs/DM1580"
            }
        ]
    },
    {
        "title": { "se": "Matematik", "en": "Mathematics" },
        "desc": {
            "se": "Vi läser samtliga matematikkurser som är grundläggande för en civilingenjörsutbildning och som ger goda förutsättningar för att bli en bra problemlösare. Kurserna ger kunskaper inom matematik både på en grundläggande och mer avancerad nivå. Vi lär oss exempelvis om hur man kan dra relevanta slutsatser baserade på sannolikhet och statistisk analys.\n\nKunskaper inom vektorgeometri är användbara inom modellering och spelutveckling.",
            "en": "We read all mathematics courses that are required for a master's degree in engineering and that provide a solid foundation for becoming a good problem solver. The courses provide knowledge in mathematics at both a basic and more advanced level. For example, we learn about how to draw good conclusions based on probability and statistical analysis. Knowledge in vector geometry is useful in modeling as well as game development."
        },
        "courses": [
            {
                "title": {
                    "se": "SF1625 Envariabelanalys",
                    "en": "SF1625 Calculus in One Variable"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SF1625"
            },
            {
                "title": {
                    "se": "SF1624 Algebra och geometri",
                    "en": "SF1624 Algebra and Geometry"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SF1624"
            },
            {
                "title": {
                    "se": "SF1626 Flervariabelanalys",
                    "en": "SF1626 Calculus in Several Variables"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SF1626"
            },
            {
                "title": {
                    "se": "SF1919 Sannolikhetsteori och statistik",
                    "en": "SF1919 Probability Theory and Statistics"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SF1919"
            },
            {
                "title": {
                    "se": "SF1662 Diskret matematik",
                    "en": "SF1662 Discrete Mathematics"
                },
                "url": "https://www.kth.se/student/kurser/kurs/SF1662"
            }
        ]
    }
]
